[
  {
    "Id": "499906",
    "ThreadId": "229001",
    "Html": "<p>Hello,</p>\r\n<p>I&acute;m writing a small application where I can analyse the search pattern of my dog when we have been hunting. I found this project and use it as a map background onto which I plot my and my dogs tracks, thank you for making this open source!</p>\r\n<p>I connect my point with a line to the corresponding dog point. If the dog is &lt;100 meters away from me the line is blue if the dog is &lt;200 meters away the line is green etc. This works fine.</p>\r\n<p>My question is:</p>\r\n<p>Is there some function that can check if the line between me and the dog is optically clear. If the dog is behind a hill I want to make the line dashed to indicate that he is out of sight.</p>\r\n<p>I guess it is fairly easily achieved by iterating along the line and check that the elevation of the map is not above the line. But I&acute;m asking here before starting to implement a home mede kludge.</p>\r\n<p>/Johan</p>",
    "PostedDate": "2010-09-29T04:48:50.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "499914",
    "ThreadId": "229001",
    "Html": "<p>sorry, hunting isn't supported here ;{</p>",
    "PostedDate": "2010-09-29T05:03:07.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "499938",
    "ThreadId": "229001",
    "Html": "<p>I must have been unclear in phrasing my question, the question is not about hunting.</p>\r\n<p>My question&nbsp;is if there is code that can be used to check if&nbsp;a&nbsp;straight line&nbsp;between two points is optically clear.</p>\r\n<p>/Johan</p>",
    "PostedDate": "2010-09-29T05:44:19.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "499948",
    "ThreadId": "229001",
    "Html": "<p>;</p>",
    "PostedDate": "2010-09-29T06:02:30.45-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "500002",
    "ThreadId": "229001",
    "Html": "<p>I dont get it but thanks anyway</p>",
    "PostedDate": "2010-09-29T07:16:34.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]