[
  {
    "Id": "514416",
    "ThreadId": "232751",
    "Html": "\r\n<p>I will create and delete GMap Control at runtime. I will have a maximum of 20 active maps. Each map will be independent of the others and will display the route generated by the vehicle. Each map will be updated every 15/30 seconds.</p>\r\n<p>Will I have any resource problem independent of memory size and processor velocity? The wpf demo.docking program looks like a little slower. Do you think that 20 maps are excessive? I will create the routes manually, not using Google geocoder service due\r\n gps point&rsquo;s precision in double directions streets.</p>\r\n<p>Yesterday I realize of the &ldquo;holographic&rdquo; effect of the blue tiles. Great&hellip;.</p>\r\n<p>I will make a request for donation to the town hall authorities when the application will be running&hellip; Are bad times in Spain....</p>\r\n<p>Best Regards and many thanks&hellip;&hellip;</p>\r\n",
    "PostedDate": "2010-10-29T00:45:30.3-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "514434",
    "ThreadId": "232751",
    "Html": "\r\n<p>each instance of control by default creates (GThreadPoolSize = 5) threads, 5*20 = 100 threads ;} thats really to much, thus if your maps are small you can decrease this number to 1 or 2</p>\r\n<p>p.s. hwat do you mean &ldquo;holographic&rdquo; effect? ;/</p>\r\n",
    "PostedDate": "2010-10-29T01:59:44.303-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "514456",
    "ThreadId": "232751",
    "Html": "\r\n<p>I will change the strategy. Now the council wants to route not only vehicles but persons as well. That&rsquo;s more than 100 active maps. No way.</p>\r\n<p>I will have dummy maps. Instead of a gmap control I will create an image of the routes and display it. So I only need one GMap control for this purpose. If the user makes double click on the image then I activate a GMap Control. So I solved the problem with\r\n 3 gmaps control.</p>\r\n<p>Holographics afaire:</p>\r\n<p>I use glasses and yesterday I was without glasses when the tile blue appears. The blue text of the tiles looks like in a background layer and the red text in other and there seems sensation of depth as same Holographics imagens. Perhaps are my eyes that\r\n are &ldquo;tired&rdquo; or you create an optical illusion unintentionally.</p>\r\n<p>Best Regards</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-10-29T02:45:36.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "514466",
    "ThreadId": "232751",
    "Html": "\r\n<p>i see ;}</p>\r\n",
    "PostedDate": "2010-10-29T03:15:01.907-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]