[
  {
    "Id": "570398",
    "ThreadId": "247121",
    "Html": "\r\n<p>I want to use an animated GIF on the map for a marker Image, but as far as I can tell, the marker image of this type doesn't work, only the current frame of the GIF at the time of rendering is displayed.</p>\r\n<p>My work around has been to create a pictureBox holding the GIF, and plotting it over the map based on a PointLatLng conversion to local coordinates. &nbsp;This works great, with one exception. &nbsp;I am using the map as a user control. &nbsp;Since the map\r\n is embedded in another application, its viewable size can change shape if the Parent application size is reduced or increased. &nbsp;All of my markers adjust correctly, however, i cannot seem to find an event that fires to allow me to update the position of\r\n the pictureBox under this circumstance. &nbsp;If I use the map_drag feature, it works fine, I am only having this issue with the map changes size due to the Parent's change in size. &nbsp;Any ideas? &nbsp;</p>\r\n<p>I have tried map.Invalidate(), Paint, Move, RegionChanged, etc. events with no luck.&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks, I love this control!!!!!!!!</p>\r\n",
    "PostedDate": "2011-02-22T13:03:51.107-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "570405",
    "ThreadId": "247121",
    "Html": "<p>can you handle size changed event too?</p>",
    "PostedDate": "2011-02-22T13:19:37.16-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "570428",
    "ThreadId": "247121",
    "Html": "<p>I think that's gonna work. &nbsp;It seems to be firing in each scenario. &nbsp;Thanks so much!! &nbsp;The responses on this project are faster than with most paid map components :)</p>\r\n<p>You rock!</p>",
    "PostedDate": "2011-02-22T13:39:28.8-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "570775",
    "ThreadId": "247121",
    "Html": "<p>thanks ;}</p>",
    "PostedDate": "2011-02-23T06:11:15.227-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]